#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/BrynardSecurity/dev-us-east-2/runs/run-KhE2GjXcEcRrWuiF

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-002913c5b9ae07b3f]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0]: Refreshing state... [id=tgw-065f28db269e83dcb]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06abf552e91106241]
module.vpc.aws_customer_gateway.this["IP1"]: Refreshing state... [id=cgw-080c6068c057d6ec3]
module.dev-us-east-2-tgw.aws_ram_resource_share.this[0]: Refreshing state... [id=arn:aws:ram:us-east-2:600252898040:resource-share/87d61065-878a-406a-b679-8eeba32ccecf]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Purpose"]: Refreshing state... [id=tgw-rtb-087d2493f3a57ef07,Purpose]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0]: Refreshing state... [id=tgw-rtb-080029f3b1b151179]
module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"]: Refreshing state... [id=tgw-rtb-087d2493f3a57ef07,Name]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-095fea460c34067cc]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-08d9b0fce5288004d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e88b4fa0d32e5225]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-099f09caa4b979e81]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a4a91c4d15a36dbe]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0763a2c706ef0066b]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b1ef4ddce1cfbfcc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f71967dae6d68fa3]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0aa59da999dd0f9bf]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-04ad07ab5e9c4651f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3087c09cb5cecac]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0613b8b9ab7cd507e]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03f98ca7e71d9985a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00afb8e3d791ad0f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0693fa5d38e04fb85]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"]: Refreshing state... [id=tgw-attach-0da1b4a9f576e75b5]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0fb1429baa15c9c97]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0dd406743cfee2409]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-000c1f1acfbe0f6de]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e88b4fa0d32e52251080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0199b6e6c573a4dbf]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3087c09cb5cecac1080289494]
module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route.this[0]: Refreshing state... [id=tgw-rtb-080029f3b1b151179_10.9.0.0/16]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a3087c09cb5cecac"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0199b6e6c573a4dbf"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-east-2-2021-12-07-private"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_default_route_table.default[0] has been changed
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-095fea460c34067cc"
      + propagating_vgws       = []
        tags                   = {
            "DefaultRouteTable" = "true"
            "Name"              = "dev-us-east-2-2021-12-07"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-05ccd9544c27b838a"
        id                   = "eipalloc-002913c5b9ae07b3f"
      + network_interface    = "eni-09ab4b9cf93978265"
      + private_dns          = "ip-10-9-11-130.us-east-2.compute.internal"
      + private_ip           = "10.9.11.130"
        tags                 = {
            "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        }
        # (8 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e88b4fa0d32e5225"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0613b8b9ab7cd507e"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-us-east-2-2021-12-07-public"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_security_group.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "default"  {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = "vpc-06abf552e91106241"
    }

  # module.dev-us-east-2-tgw.aws_ec2_tag.this["Name"] will be updated in-place
  ~ resource "aws_ec2_tag" "this" {
        id          = "tgw-rtb-087d2493f3a57ef07,Name"
      ~ value       = "dev-us-east-2-tgw-2021-12-07" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway" "this" {
        id                                 = "tgw-065f28db269e83dcb"
      ~ tags                               = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                           = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_route_table.this[0] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_route_table" "this" {
        id                              = "tgw-rtb-080029f3b1b151179"
      ~ tags                            = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ec2_transit_gateway_vpc_attachment.this["vpc"] will be updated in-place
  ~ resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
        id                                              = "tgw-attach-0da1b4a9f576e75b5"
      ~ tags                                            = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                                        = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07-vpc"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.dev-us-east-2-tgw.aws_ram_resource_association.this[0] will be created
  + resource "aws_ram_resource_association" "this" {
      + id                 = (known after apply)
      + resource_arn       = "arn:aws:ec2:us-east-2:600252898040:transit-gateway/tgw-065f28db269e83dcb"
      + resource_share_arn = "arn:aws:ram:us-east-2:600252898040:resource-share/87d61065-878a-406a-b679-8eeba32ccecf"
    }

  # module.dev-us-east-2-tgw.aws_ram_resource_share.this[0] will be updated in-place
  ~ resource "aws_ram_resource_share" "this" {
        id                        = "arn:aws:ram:us-east-2:600252898040:resource-share/87d61065-878a-406a-b679-8eeba32ccecf"
      ~ name                      = "dev-us-east-2-tgw-2021-12-07" -> (known after apply)
      ~ tags                      = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
      ~ tags_all                  = {
          - "Name"    = "dev-us-east-2-tgw-2021-12-07"
          - "Purpose" = "hvn-tgw-dev-us-east-2"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_customer_gateway.this["IP1"] will be updated in-place
  ~ resource "aws_customer_gateway" "this" {
        id          = "cgw-080c6068c057d6ec3"
      ~ tags        = {
          - "Name" = "dev-us-east-2-2021-12-07-IP1"
        } -> (known after apply)
      ~ tags_all    = {
          - "Name" = "dev-us-east-2-2021-12-07-IP1"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-095fea460c34067cc"
      ~ tags                   = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all               = {
          - "DefaultRouteTable" = "true"
          - "Name"              = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-002913c5b9ae07b3f"
      ~ tags                 = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0613b8b9ab7cd507e"
      ~ tags     = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0199b6e6c573a4dbf"
      ~ tags                 = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
      ~ tags_all             = {
          - "Name" = "dev-us-east-2-2021-12-07-us-east-2a"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a3087c09cb5cecac"
      ~ tags             = {
          - "Name" = "dev-us-east-2-2021-12-07-private"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-east-2-2021-12-07-private"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e88b4fa0d32e5225"
      ~ tags             = {
          - "Name" = "dev-us-east-2-2021-12-07-public"
        } -> (known after apply)
      ~ tags_all         = {
          - "Name" = "dev-us-east-2-2021-12-07-public"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0763a2c706ef0066b"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0a4a91c4d15a36dbe"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-04ad07ab5e9c4651f"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-private-us-east-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-099f09caa4b979e81"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2a"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2a"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0f71967dae6d68fa3"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2b"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2b"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0b1ef4ddce1cfbfcc"
      ~ tags                            = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2c"
        } -> (known after apply)
      ~ tags_all                        = {
          - "Name" = "dev-us-east-2-2021-12-07-public-us-east-2c"
        } -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-06abf552e91106241"
      ~ tags                             = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all                         = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpn_gateway.this[0] will be updated in-place
  ~ resource "aws_vpn_gateway" "this" {
        id              = "vgw-0aa59da999dd0f9bf"
      ~ tags            = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
      ~ tags_all        = {
          - "Name" = "dev-us-east-2-2021-12-07"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 20 to change, 0 to destroy.


```

</details>

*Pusher: @RalphBrynard, Action: `pull_request`*